<template>
  <HeaderWidget/>
  <ContentGridWidget>
    <!--  v-for  -->
    <ContentItem>
      <img src="../assets/cover.jpg" alt="Преступление и наказание">
      <div class="text">
        <div class="name flex-center">Преступление и наказание</div>
        <div class="description">
          <p>«Преступле́ние и наказа́ние» (рус. дореф. Преступленіе и наказаніе) — социально-психологический и социально-философский роман Фёдора Михайловича Достоевского, над которым писатель работал в 1865—1866 годах. Впервые опубликован в 1866 году в журнале «Русский вестник» (№ 1, 2, 4, 6—8, 11, 12). Через год вышло в свет отдельное издание, структура которого была немного изменена по сравнению с журнальной редакцией; кроме того, автор внёс в книжный вариант ряд сокращений и стилистических правок.

            Замысел «Преступления и наказания» созревал у Достоевского в течение многих лет, однако центральная тема, связанная с идеей главного героя об «обыкновенных» и «необыкновенных» людях, начала формироваться только в 1863 году в Италии. Приступив к непосредственной работе над произведением, автор объединил черновики незавершённого романа «Пьяненькие», в котором была намечена сюжетная линия, повествующая о семье Мармеладовых, и наброски романа-исповеди, задуманного как откровение каторжанина. В процессе работы план расширился, и в основу сюжета легло преступление студента Родиона Раскольникова, убившего ради спасения близких старуху-процентщицу. При этом криминальная история стала для автора не только темой, но и поводом для размышлений о социальных обстоятельствах, толкающих человека на преступления, а также возможностью показать, какие сложные «химические» процессы происходят в душах людей. Одним из образов романа стал большой город второй половины XIX века, жизнь в котором полна конфликтов и драм. В произведении воссозданы узнаваемые приметы времени, воспроизведена петербургская топография.</p>
        </div>
      </div>
    </ContentItem>
  </ContentGridWidget>
</template>

<script setup>
import ContentGridWidget from '@/components/ContentGridWidget.vue'
import HeaderWidget from '@/components/TheHeader.vue'
import ContentItem from '@/components/ContentGridWidgetItem.vue'
</script>
