<template>
  <ContentDetailWidget>
    <template #title>
      {{ model.title }}
    </template>

    <template #side-label>
      <a href="/authors/slug">{{ author_name }}</a>
    </template>

    <template #content>
      <DescriptionWidget>
        <div class="photo">
          <img :src="model.cover" :alt="model.title">
          <EstimationWidget>
            <div>🌟{{ model.score }}</div>
            <div>📚{{ model.popularity }}</div>
          </EstimationWidget>
        </div>
        <div class="text book-text">{{ model.description }}</div>
      </DescriptionWidget>
      <CommentsList/>
    </template>

    <template #sidebar>
      <img :src="model.author.image" :alt="author_name">
    </template>
  </ContentDetailWidget>
</template>

<script>

import CommentsList from '@/components/CommentList.vue'
import ContentDetailWidget from '@/components/ContentDetailWidget.vue'
import EstimationWidget from '@/components/BaseEstimation.vue'
import DescriptionWidget from '@/components/BaseDescription.vue'

export default {
  components: { DescriptionWidget, EstimationWidget, ContentDetailWidget, CommentsList },
  data () {
    return {
      model: {
        author: {
          name: 'Федор',
          surname: 'Достоевский',
          image: '/img/Достоевский.d8b22864.jpg'
        },
        title: 'Преступление и наказание',
        score: 5,
        popularity: 900,
        cover: '/img/cover.f06e9953.jpg',
        description: '«Преступле́ние и наказа́ние» (рус. дореф. Преступленіе и наказаніе) — социально-психологический и\n' +
          '          социально-философский роман Фёдора Михайловича Достоевского, над которым писатель работал в 1865—1866 годах.\n' +
          '          Впервые опубликован в 1866 году в журнале «Русский вестник» (№ 1, 2, 4, 6—8, 11, 12). Через год вышло в свет\n' +
          '          отдельное издание, структура которого была немного изменена по сравнению с журнальной редакцией; кроме того,\n' +
          '          автор внёс в книжный вариант ряд сокращений и стилистических правок.\n' +
          '          Замысел «Преступления и наказания» созревал у Достоевского в течение многих лет, однако центральная тема,\n' +
          '          связанная с идеей главного героя об «обыкновенных» и «необыкновенных» людях, начала формироваться только в\n' +
          '          1863 году в Италии. Приступив к непосредственной работе над произведением, автор объединил черновики\n' +
          '          незавершённого романа «Пьяненькие», в котором была намечена сюжетная линия, повествующая о семье Мармеладовых,\n' +
          '          и наброски романа-исповеди, задуманного как откровение каторжанина. В процессе работы план расширился, и в\n' +
          '          основу сюжета легло преступление студента Родиона Раскольникова, убившего ради спасения близких\n' +
          '          старуху-процентщицу. При этом криминальная история стала для автора не только темой, но и поводом для\n' +
          '          размышлений о социальных обстоятельствах, толкающих человека на преступления, а также возможностью показать,\n' +
          '          какие сложные «химические» процессы происходят в душах людей. Одним из образов романа стал большой город\n' +
          '          второй половины XIX века, жизнь в котором полна конфликтов и драм. В произведении воссозданы узнаваемые\n' +
          '          приметы времени, воспроизведена петербургская топография.'
      }
    }
  },
  computed: {
    author_name () {
      return this.model.author.name + ' ' + this.model.author.surname
    }
  }
}

</script>

<style scoped>
.book-text {
  max-height: 600px;
  overflow: scroll;
  overflow-x: hidden;
}

</style>
